Notepad1/new 13.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:findOrganization>
         <typ:findCriteria>
            <typ1:fetchStart>0</typ1:fetchStart>
            <typ1:fetchSize>-1</typ1:fetchSize>
            <!--Optional:-->
            <typ1:filter>
               <!--Optional:-->
               <typ1:conjunction>?</typ1:conjunction>
               <!--1 to 500 repetitions:-->
               <typ1:group>
                  <!--Optional:-->
                  <typ1:conjunction>?</typ1:conjunction>
                  <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                  <!--1 to 500 repetitions:-->
                  <typ1:item>
                     <!--Optional:-->
                     <typ1:conjunction>?</typ1:conjunction>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <typ1:attribute>?</typ1:attribute>
                     <typ1:operator>?</typ1:operator>
                     <!--You have a CHOICE of the next 2 items at this level-->
                     <!--0 to 500 repetitions:-->
                     <typ1:value>?</typ1:value>
                     <typ1:nested/>
                  </typ1:item>
               </typ1:group>
               <!--0 to 500 repetitions:-->
               <typ1:nested/>
            </typ1:filter>
            <!--Optional:-->
            <typ1:sortOrder>
               <!--1 to 500 repetitions:-->
               <typ1:sortAttribute>
                  <typ1:name>?</typ1:name>
                  <typ1:descending>false</typ1:descending>
               </typ1:sortAttribute>
            </typ1:sortOrder>
            <!--0 to 500 repetitions:-->
            <typ1:findAttribute>?</typ1:findAttribute>
            <typ1:excludeAttribute>false</typ1:excludeAttribute>
            <!--0 to 500 repetitions:-->
            <typ1:childFindCriteria>
               <typ1:fetchStart>0</typ1:fetchStart>
               <typ1:fetchSize>-1</typ1:fetchSize>
               <!--Optional:-->
               <typ1:filter>
                  <!--Optional:-->
                  <typ1:conjunction>?</typ1:conjunction>
                  <!--1 to 500 repetitions:-->
                  <typ1:group>
                     <!--Optional:-->
                     <typ1:conjunction>?</typ1:conjunction>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <!--1 to 500 repetitions:-->
                     <typ1:item>
                        <!--Optional:-->
                        <typ1:conjunction>?</typ1:conjunction>
                        <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                        <typ1:attribute>?</typ1:attribute>
                        <typ1:operator>?</typ1:operator>
                        <!--You have a CHOICE of the next 2 items at this level-->
                        <!--0 to 500 repetitions:-->
                        <typ1:value>?</typ1:value>
                        <typ1:nested/>
                     </typ1:item>
                  </typ1:group>
                  <!--0 to 500 repetitions:-->
                  <typ1:nested/>
               </typ1:filter>
               <!--Optional:-->
               <typ1:sortOrder>
                  <!--1 to 500 repetitions:-->
                  <typ1:sortAttribute>
                     <typ1:name>?</typ1:name>
                     <typ1:descending>false</typ1:descending>
                  </typ1:sortAttribute>
               </typ1:sortOrder>
               <!--0 to 500 repetitions:-->
               <typ1:findAttribute>?</typ1:findAttribute>
               <typ1:excludeAttribute>false</typ1:excludeAttribute>
               <!--0 to 500 repetitions:-->
               <typ1:childFindCriteria/>
               <typ1:childAttrName>?</typ1:childAttrName>
            </typ1:childFindCriteria>
         </typ:findCriteria>
         <typ:findControl>
            <typ1:retrieveAllTranslations>false</typ1:retrieveAllTranslations>
         </typ:findControl>
      </typ:findOrganization>
   </soapenv:Body>
</soapenv:Envelope>